In [1]:
import MySQLdb

### Establish a Connection with DB

In [2]:
conn1= MySQLdb.connect(host="localhost",database="demo",user= "root",password= "Mayank123")

### Cursor contains all the data fetched from DB in a rows and is also used to execute commands in DB

In [3]:
cursor1 = conn1.cursor()

In [4]:
cursor1.execute("DROP TABLE IF EXISTS students")

0

In [5]:
que= " CREATE TABLE students(ROLL int ,PRIMARY KEY(ROLL),NAME varchar(20))"

In [6]:
cursor1.execute(que)

0

#### Add multiple values together

In [7]:
sql= "INSERT INTO students values(%s,%s)"
val= [(22,'naman'),(23,'rosy'),(24,'Mayank'),(25,'Kamal')]
cursor1.executemany(sql,val)
conn1.commit()

In [8]:
cursor1.execute("SELECT * FROM students")

4

### Print values

In [9]:
rows= cursor1.fetchall()
for row in rows:
    print(row)

(22, 'naman')
(23, 'rosy')
(24, 'Mayank')
(25, 'Kamal')

### Add more values always use try and exceptions so as to catch any issue

In [10]:
val=[(23,'nomy')]
try:
    cursor1.executemany(sql,val)
    conn1.commit()
    
except MySQLdb.Error:
    
    print('record already exists')

record already exists

## We can also extract columns into different variables

In [11]:
sql= "SELECT * FROM students"

try:
    cursor1.execute(sql)
    results= cursor1.fetchall()
    for row in results:
        Roll= row[0]
        name= row[1]
        print("roll number =%d, name= %s"%(Roll,name))
    
except MySQLdb.Error:
    print('record already exists')

roll number =22, name= naman
roll number =23, name= rosy
roll number =24, name= Mayank
roll number =25, name= Kamal

### If we want to import all data in dataframe then give connection string and select query

In [12]:
import pandas as pd

query= "SELECT * FROM students"
data= pd.read_sql(query,conn1)
data.head()

   ROLL    NAME
0    22   naman
1    23    rosy
2    24  Mayank
3    25   Kamal

### Close cursor and connection once its done

In [13]:
cursor1.close()

In [14]:
conn1.close()